batitous/klipos/klipos/hw/include/mcu/lpc1549.h
/****************************************************************************
 *   LPC13xx.h - 2011-04-28
 *
 *   Based on original by NXP with modifications by Code Red Technologies
 *
 *   Project: NXP LPC13xx software example
 *
 *   Description:
 *     CMSIS Cortex-M3 Core Peripheral Access Layer Header File for
 *     NXP LPC13xx Device Series
 *
 ****************************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
****************************************************************************/

#ifndef __LPC1549_H__
#define __LPC1549_H__

#ifdef __cplusplus
extern "C" {
#endif

    
/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
 */

typedef enum IRQn {
	Reset_IRQn                    = -15,	/*!< Reset Vector, invoked on Power up and warm reset */
	NonMaskableInt_IRQn           = -14,	/*!< Non maskable Interrupt, cannot be stopped or preempted */
	HardFault_IRQn                = -13,	/*!< Hard Fault, all classes of Fault               */
	MemoryManagement_IRQn         = -12,	/*!< Memory Management, MPU mismatch, including Access Violation and No Match */
	BusFault_IRQn                 = -11,	/*!< Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
	UsageFault_IRQn               = -10,	/*!< Usage Fault, i.e. Undef Instruction, Illegal State Transition */
	SVCall_IRQn                   =  -5,	/*!< System Service Call via SVC instruction         */
	DebugMonitor_IRQn             =  -4,	/*!< Debug Monitor                                   */
	PendSV_IRQn                   =  -2,	/*!< Pendable request for system service             */
	SysTick_IRQn                  =  -1,	/*!< System Tick Timer                               */

	WDT_IRQn                      = 0,		/*!< Watchdog timer Interrupt                         */
	//WWDT_IRQn                     = WDT_IRQn,	/*!< Watchdog timer Interrupt alias for WDT_IRQn    */
	BOD_IRQn                      = 1,		/*!< Brown Out Detect(BOD) Interrupt                  */
	FMC_IRQn                      = 2,		/*!< FLASH Interrupt                                  */
	FLASHEEPROM_IRQn              = 3,		/*!< EEPROM controller interrupt                      */
	DMA_IRQn                      = 4,		/*!< DMA Interrupt                                    */
	GINT0_IRQn                    = 5,		/*!< GPIO group 0 Interrupt                           */
	GINT1_IRQn                    = 6,		/*!< GPIO group 1 Interrupt                           */
	PIN_INT0_IRQn                 = 7,		/*!< Pin Interrupt 0                                  */
	PIN_INT1_IRQn                 = 8,		/*!< Pin Interrupt 1                                  */
	PIN_INT2_IRQn                 = 9,		/*!< Pin Interrupt 2                                  */
	PIN_INT3_IRQn                 = 10,		/*!< Pin Interrupt 3                                  */
	PIN_INT4_IRQn                 = 11,		/*!< Pin Interrupt 4                                  */
	PIN_INT5_IRQn                 = 12,		/*!< Pin Interrupt 5                                  */
	PIN_INT6_IRQn                 = 13,		/*!< Pin Interrupt 6                                  */
	PIN_INT7_IRQn                 = 14,		/*!< Pin Interrupt 7                                  */
	RITIMER_IRQn                  = 15,		/*!< RITIMER interrupt                                */
	SCT0_IRQn                     = 16,		/*!< SCT0 interrupt                                   */
	SCT_IRQn                      = SCT0_IRQn,	/*!< Optional alias for SCT0_IRQn                  */
	SCT1_IRQn                     = 17,		/*!< SCT1 interrupt                                   */
	SCT2_IRQn                     = 18,		/*!< SCT2 interrupt                                   */
	SCT3_IRQn                     = 19,		/*!< SCT3 interrupt                                   */
	MRT_IRQn                      = 20,		/*!< MRT interrupt                                    */
	UART0_IRQn                    = 21,		/*!< UART0 Interrupt                                  */
	UART1_IRQn                    = 22,		/*!< UART1 Interrupt                                  */
	UART2_IRQn                    = 23,		/*!< UART2 Interrupt                                  */
	I2C0_IRQn                     = 24,		/*!< I2C0 Interrupt                                   */
	I2C_IRQn                      = I2C0_IRQn,	/*!< Optional alias for I2C0_IRQn                  */
	SPI0_IRQn                     = 25,		/*!< SPI0 Interrupt                                   */
	SPI1_IRQn                     = 26,		/*!< SPI1 Interrupt                                   */
	CAN_IRQn                      = 27,		/*!< CAN Interrupt                                    */
	USB0_IRQn                     = 28,		/*!< USB IRQ interrupt                                */
	USB_IRQn                      = USB0_IRQn,	/*!< Optional alias for USB0_IRQn                  */
	USB0_FIQ_IRQn                 = 29,		/*!< USB FIQ interrupt                                */
	USB_FIQ_IRQn                  = USB0_FIQ_IRQn,	/*!< Optional alias for USB0_FIQ_IRQn         */
	USB_WAKEUP_IRQn               = 30,		/*!< USB wake-up interrupt Interrupt                  */
	ADC0_SEQA_IRQn                = 31,		/*!< ADC0_A sequencer Interrupt                       */
	ADC0_A_IRQn                   = ADC0_SEQA_IRQn,	/*!< Optional alias for ADC0_SEQA_IRQn        */
	ADC_A_IRQn                    = ADC0_SEQA_IRQn,	/*!< Optional alias for ADC0_SEQA_IRQn        */
	ADC0_SEQB_IRQn                = 32,		/*!< ADC0_B sequencer Interrupt                       */
	ADC0_B_IRQn                   = ADC0_SEQB_IRQn,	/*!< Optional alias for ADC0_SEQB_IRQn        */
	ADC_B_IRQn                    = ADC0_SEQB_IRQn,	/*!< Optional alias for ADC0_SEQB_IRQn        */
	ADC0_THCMP                    = 33,		/*!< ADC0 threshold compare interrupt                 */
	ADC0_OVR                      = 34,		/*!< ADC0 overrun interrupt                           */
	ADC1_SEQA_IRQn                = 35,		/*!< ADC1_A sequencer Interrupt                       */
	ADC1_A_IRQn                   = ADC1_SEQA_IRQn,	/*!< Optional alias for ADC1_SEQA_IRQn        */
	ADC1_SEQB_IRQn                = 36,		/*!< ADC1_B sequencer Interrupt                       */
	ADC1_B_IRQn                   = ADC1_SEQB_IRQn,	/*!< Optional alias for ADC1_SEQB_IRQn        */
	ADC1_THCMP                    = 37,		/*!< ADC1 threshold compare interrupt                 */
	ADC1_OVR                      = 38,		/*!< ADC1 overrun interrupt                           */
	DAC_IRQ                       = 39,		/*!< DAC interrupt                                    */
	CMP0_IRQ                      = 40,		/*!< Analog comparator 0 interrupt                    */
	CMP_IRQn                      = CMP0_IRQ,	/*!< Optional alias for CMP0_IRQ                    */
	CMP1_IRQ                      = 41,		/*!< Analog comparator 1 interrupt                    */
	CMP2_IRQ                      = 42,		/*!< Analog comparator 2 interrupt                    */
	CMP3_IRQ                      = 43,		/*!< Analog comparator 3 interrupt                    */
	QEI_IRQn                      = 44,		/*!< QEI interrupt                                    */
	RTC_ALARM_IRQn                = 45,		/*!< RTC alarm interrupt                              */
	RTC_WAKE_IRQn                 = 46,		/*!< RTC wake-up interrupt                            */
} IRQn_Type;


